app/controllers/home_controller.rb

  def show
    @handle = User.find(params[:id])
    @celeb = @handle.find_closest_celeb
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 83]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1

  def topten
    @topten = User.select(:name, :score_f).where.not(score_f: nil).where.not(name: "").order(score_f: :desc).limit(10).uniq(:name)
---
SELECT  DISTINCT "users"."name", "users"."score_f" FROM "users"  ORDER BY "users"."score_f" DESC LIMIT 10