twitter-narcissist-app/app/controllers/home_controller.rb

  def new
    @handle = User.new
    @handle.name = params[:handle]
    @handle.save
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "lickaboot"], ["created_at", "2015-07-15 04:02:23.639459"], ["updated_at", "2015-07-15 04:02:23.639459"]]

  def show

    @handle = User.find(params[:id])
    @celeb = @handle.find_closest_celeb
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1

  def topten

    @topten = User.select(:name, :score_f).order(score_f: :desc).limit(10)
---
SELECT  "users"."id", "users"."name", "users"."score_f" FROM "users"  ORDER BY "users"."id" DESC LIMIT 10